import streamlit as st

def yolo_info():
    st.markdown("""
    # Распознавание изображений на основе машинного обучения
    
    YOLO (You Only Look Once) — это модель машинного обучения для распознавания объектов, 
    которая использует концепцию сверточных нейронных сетей для выделения объектов. 
    Модель способна обнаруживать объекты, классифицировать их и определить их 
    местоположение на изображении за одну итерацию, что делает ее очень быстрой 
    по сравнению с другими методами распознавания объектов.
    
    Распознавание изображений играет важную роль в современных технологиях, 
    и его применение варьируется от автоматического тегирования контента в социальных 
    сетях до обнаружения дефектов на производственных линиях и автономного вождения.
    
    **Этот проект был разработан абсолютно бесплатно с целью тестирования технологии 
    и распространения знаний о ней.** Его цель - помочь людям понять, как работает 
    распознавание изображений на практике и как можно использовать его для решения 
    различных проблем.
    
    Репозиторий можно найти тут https://github.com/pavlenkoprog/Streamlit_Image_detection_FABLAB
    
    По вопросам сотрудничества обращайтесь в группу в ВК https://vk.com/fablabkfuv
    
    или на почту fablab@cfuv.ru
    """)

def bone_fracture_info():
    st.title("Значение распознавания переломов на рентгеновских снимках костей")

    st.write("""
        ## Значение распознавания переломов

        Рентгеновские снимки костей являются ценным инструментом в медицине, 
        позволяющим диагностировать различные заболевания и травмы. 
        Одним из наиболее частых применений рентгеновских снимков костей является обнаружение переломов.

        Переломы могут быть серьезной проблемой, вызывающей боль и ограничение функциональности. 
        Если не обнаружить и не лечить перелом вовремя, это может привести к долгосрочным последствиям, 
        таким как деформация костей, хроническая боль и потеря функции конечности.

        ## Польза от распознавания переломов на рентгеновских снимках

        Благодаря распознаванию переломов на рентгеновских снимках костей, 
        врачи могут быстро и точно определить место и степень перелома. 
        Это позволяет выбрать наиболее эффективную стратегию лечения, 
        что в конечном итоге приводит к быстрому восстановлению пациента.

        Сегодня, с применением технологий искусственного интеллекта и машинного обучения, 
        мы можем автоматизировать и упростить процесс распознавания переломов. 
        Это не только сокращает время, необходимое для диагностики, 
        но и улучшает точность обнаружения переломов.

        """)

def kidney_stone_info():
    st.title("Значение распознавания камней в почках")

    st.write("""
        ## Значение распознавания камней в почках

        Камни в почках - это распространенное заболевание, которое может вызвать значительные боли и дискомфорт. 
        Быстрое и точное распознавание камней в почках может 
        помочь медицинским специалистам определить наиболее эффективное лечение, 
        чтобы облегчить симптомы и предотвратить долгосрочные осложнения.

        ## Польза от распознавания камней в почках с помощью машинного обучения

        Технологии машинного обучения могут играть ключевую роль в распознавании камней в почках. 
        Используя алгоритмы машинного обучения, мы можем автоматизировать 
        процесс обнаружения камней в почках на медицинских изображениях, 
        таких как КТ или ультразвук. Это не только сокращает время, необходимое для диагностики, 
        но и может улучшить точность обнаружения камней в почках.

        Использование машинного обучения для обнаружения камней в почках также может помочь 
        исключить человеческие ошибки и уменьшить нагрузку на радиологов, 
        позволяя им сосредоточиться на более сложных задачах. 
        """)


def search_victims_info():
    st.title("Важность поиска пострадавших людей с воздуха с помощью машинного обучения")

    st.write("""
        ## Важность поиска пострадавших людей с воздуха

        Поиск пострадавших людей с воздуха - это критически важная задача в ситуациях экстренной помощи, 
        таких как аварии, природные катастрофы или военные конфликты. 
        Быстрое и эффективное обнаружение пострадавших может спасти жизни и предотвратить долгосрочные осложнения.

        ## Польза от использования машинного обучения для поиска пострадавших с воздуха

        Технологии машинного обучения могут играть ключевую роль в поиске пострадавших людей с воздуха. 
        Используя алгоритмы машинного обучения, мы можем автоматизировать процесс обнаружения пострадавших на аэрофотоснимках или видео. 
        Это не только ускоряет время реакции, но и может улучшить точность обнаружения людей в труднодоступных или опасных областях.

        Использование машинного обучения для поиска пострадавших с воздуха также может 
        помочь исключить человеческие ошибки и уменьшить нагрузку на спасательные службы, 
        позволяя им сосредоточиться на более сложных задачах и операциях по спасению. 
        """)


def plant_disease_info():
    st.title("Значение распознавания болезней растений")

    st.write("""
        ## Значение распознавания болезней растений

        Болезни растений могут серьезно повлиять на урожай и качество продуктов питания, 
        что может привести к значительным экономическим потерям. 
        Быстрое и точное распознавание болезней растений может помочь фермерам и агрономам определить наиболее 
        эффективные меры контроля, чтобы предотвратить распространение болезни и сохранить урожай.

        ## Польза от распознавания болезней растений с помощью машинного обучения

        Технологии машинного обучения могут играть ключевую роль в распознавании болезней растений. 
        Используя алгоритмы машинного обучения, мы можем автоматизировать процесс обнаружения болезней на 
        изображениях растений. Это не только сокращает время, необходимое для диагностики, 
        но и может улучшить точность обнаружения болезней.

        Использование машинного обучения для обнаружения болезней растений также может помочь 
        исключить человеческие ошибки и уменьшить нагрузку на агрономов, 
        позволяя им сосредоточиться на более сложных задачах. 
        """)


def blood_cell_recognition_info():
    st.title("Значение распознавания типов клеток крови")

    st.write("""
        ## Значение распознавания типов клеток крови

        Анализ крови - это ключевой элемент в диагностике многих заболеваний. 
        Точное распознавание и классификация различных типов клеток крови могут способствовать 
        более быстрому и точному постановлению диагноза, а также определению наиболее подходящего лечения.

        ## Польза от распознавания типов клеток крови с помощью машинного обучения

        Машинное обучение может играть ключевую роль в распознавании и классификации клеток крови. 
        Используя алгоритмы машинного обучения, мы можем автоматизировать этот процесс, 
        что позволяет ускорить время анализа и повысить его точность.

        В частности, машинное обучение может помочь в автоматическом распознавании аномалий в 
        форме или размере клеток крови, что может указывать на определенные заболевания. 
        Это уменьшает вероятность человеческой ошибки и позволяет медицинским 
        специалистам сосредоточиться на более сложных аспектах диагностики и лечения.
        """)


def forest_fire_detection_info():
    st.title("Важность распознавания очагов пожаров в лесах")

    st.write("""
        ## Важность распознавания очагов пожаров в лесах

        Лесные пожары - это серьезная проблема, которая может вызвать значительный 
        ущерб экосистеме и часто приводит к потере жизней и имущества. Поэтому быстрое 
        обнаружение и распознавание очагов пожаров является критически важным для минимизации ущерба.

        ## Польза от распознавания очагов пожаров с помощью дронов и машинного обучения

        Дроны и технологии машинного обучения могут играть ключевую роль в обнаружении и 
        распознавании очагов пожаров в лесах. Используя алгоритмы машинного обучения, 
        мы можем автоматизировать процесс обнаружения пожаров на аэрофотоснимках, 
        сделанных дронами. Это не только сокращает время, необходимое для обнаружения пожаров, 
        но и может значительно улучшить точность и эффективность обнаружения.

        Также использование машинного обучения может помочь в определении трендов и паттернов, 
        которые могут указывать на повышенный риск пожара в определенных областях. 
        Это позволяет предпринять предварительные меры для предотвращения пожаров и уменьшить их воздействие.
        """)


def brain_tumor_detection_info():
    st.title("Значение детекции опухолей головного мозга")

    st.write("""
        ## Значение детекции опухолей головного мозга

        Рак мозга - это серьезное и часто смертельное заболевание. 
        Раннее обнаружение опухолей мозга может значительно улучшить прогноз и результаты лечения для пациентов. 
        Поэтому быстрое и точное определение и классификация опухолей головного мозга являются критически важными.

        ## Польза от детекции опухолей головного мозга с помощью машинного обучения

        Машинное обучение может играть ключевую роль в обнаружении и классификации опухолей мозга. 
        С помощью алгоритмов машинного обучения мы можем автоматизировать этот процесс на изображениях МРТ, 
        что позволяет ускорить диагностику и повысить ее точность.

        В частности, машинное обучение может помочь в автоматическом распознавании аномалий в 
        форме или размере областей мозга, что может указывать на наличие опухоли. 
        Это уменьшает вероятность человеческой ошибки и позволяет медицинским специалистам 
        сосредоточиться на более сложных аспектах диагностики и лечения.
        """)


def grape_disease_detection_info():
    st.title("Значение детекции болезней винограда")

    st.write("""
        ## Значение детекции болезней винограда

        Болезни винограда, особенно грибковые инфекции, 
        могут значительно снизить урожайность и качество урожая. 
        Быстрая и точная детекция заболеваний винограда может помочь фермерам 
        своевременно применить необходимое лечение и минимизировать потери.

        ## Польза от детекции болезней винограда с помощью машинного обучения

        Машинное обучение может играть ключевую роль в детекции и классификации болезней винограда. 
        Используя алгоритмы машинного обучения, мы можем автоматизировать этот процесс на основе анализа 
        изображений листьев винограда, что позволяет ускорить диагностику и повысить ее точность.

        Кроме того, машинное обучение может помочь в подборе наиболее подходящих пестицидов для 
        борьбы с определенными заболеваниями. Это позволяет оптимизировать использование пестицидов, 
        снизить их вредное воздействие на окружающую среду и улучшить эффективность их применения.
        """)